app/controllers/aesclasses_controller.rb

SELECT "aesclasses".* FROM "aesclasses"
---
  def index
    @aesclasses = Aesclass.all

INSERT INTO "aesclasses" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "X123"], ["created_at", 2016-11-24 15:53:57 UTC], ["updated_at", 2016-11-24 15:53:57 UTC]]
---
  def create
    @aesclass = Aesclass.new(aesclass_params)

    respond_to do |format|
      if @aesclass.save

SELECT  "aesclasses".* FROM "aesclasses" WHERE "aesclasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_aesclass
      @aesclass = Aesclass.find(params[:id])