app/controllers/books_controller.rb

  def index
    # @books = Book.all

    if params[:search]
      @books = Book.search(params[:search])
---
SELECT "books".* FROM "books"