app/controllers/bookdetails_controller.rb

  def index
    @bookdetails = Bookdetail.all
---
SELECT "bookdetails".* FROM "bookdetails"

  def create
    @bookdetail = Bookdetail.new(bookdetail_params)

    respond_to do |format|
      if @bookdetail.save
---
INSERT INTO "bookdetails" ("Leihbuch", "imgpath", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Leihbuch", false], ["imgpath", ""], ["created_at", 2016-11-24 16:42:45 UTC], ["updated_at", 2016-11-24 16:42:45 UTC]]

    def set_bookdetail
      @bookdetail = Bookdetail.find(params[:id])
---
SELECT  "bookdetails".* FROM "bookdetails" WHERE "bookdetails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]