app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    if params[:search]
      @students = Student.search(params[:id])